{"page": 1, "page_count": 394, "results": [{"type": "external", "name": "Platform Developer", "model_type": "jobs", "levels": [{"name": "Mid Level", "short_name": "mid"}, {"name": "Senior Level", "short_name": "senior"}], "company": {"name": "Atlassian", "short_name": "atlassian", "id": 741}, "locations": [{"name": "San Francisco Bay Area"}], "id": 38324, "categories": [{"name": "Engineering"}], "contents": "<h5>Job Description<\/h5>\n\n<p>Atlassian is looking for experienced and talented Platform Engineers to join our new Platform Developent team. This role involves the design, implementation and maintenance of a new hosted platform. Be a part of an energetic and fast moving team that delivers incredible, innovative improvements to our products. You’ll collaborate often with other developers to write the best code for the project and deliver amazing results that our users love.<\/p>\n\n<p><br /><\/p>\n\n<p><br /><\/p>\n\n<p>MORE ABOUT YOU<\/p>\n\n<p>You confidently design and implement high-performance RESTful micro-services serving millions of requests a day. You are fluent in any modern object oriented programming language like Java, Scala, Python, Javascript, etc. Open to collaboration, you thrive on innovation and solving complex issues. You have broad knowledge and understanding of SaaS, PaaS, IaaS industry with hands on experience of public cloud offerings (AWS, GAE, Azure). With over 5+ years in a similar development role, you are able to tackle large problems whilst maintaining a relaxed yet enthusiastic attitude. Knowledge of open source technologies in the PaaS/IaaS space is a big bonus. Experience working with agile software development methodologies like XP and Scrum, continuous delivery and infrastructure as code would be a big plus as well.<\/p>\n\n<p><br /><\/p>\n\n<p><br /><\/p>\n\n<p>MORE ABOUT OUR TEAM<\/p>\n\n<p>We are always growing, learning, and adapting, in and out of the office. You’ll be joining a team that is crazy smart and very direct. We ask hard questions and challenge each other to constantly improve our work. We are self-driven but team oriented. We&apos;re dedicated to agile methodology and big believers in &apos;lean&apos; (which means we don’t do documentation for documentation&apos;s sake). We know the importance of validating our assumptions about users and implement various types of testing to prove ourselves right (or wrong). Our bottom line is improving our user’s experience- no matter what.<\/p>\n\n<p><br /><\/p>\n\n<h5>Additional Information<\/h5>\n\n<p>All your information will be kept confidential according to EEO guidelines.<\/p>", "publication_date": "2016-03-01T21:49:23.624592Z", "short_name": "platform-developer-4d9d55", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/atlassian/platform-developer-4d9d55"}}, {"type": "external", "name": "Software Engineer - backend", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}, {"name": "Mid Level", "short_name": "mid"}], "company": {"name": "Scribd", "short_name": "scribd", "id": 735}, "locations": [{"name": "San Francisco Bay Area"}], "id": 31635, "categories": [{"name": "Engineering"}], "contents": "<p style=\"padding-left: 150px;\">618 &nbsp;&nbsp;CE - T&rsquo;ang Dynasty China creates the first prints using wooden blocks<\/p>\n\n<p style=\"padding-left: 150px;\">1440 CE - Johannes Gutenberg invents the modern printing press<\/p>\n\n<p style=\"padding-left: 150px;\">2013 CE - Scribd launches subscription reading service<\/p>\n\n<p>At Scribd, we&rsquo;ve dedicated ourselves to building the most comprehensive, accessible, and delightful reading experience you can find on a screen. We launched our original platform in 2007 but we turned over a new leaf in 2013 when we pioneered the all-you-can-read model, giving millions of bookworms-on-a-budget access to the world&rsquo;s largest digital library.<\/p>\n\n<p>With more than 80 million active readers, clocking more than 20 million hours, we are the largest Rails site by traffic. Our library includes more than one million titles from nearly 1,000 publishers across genres from <em>New York Times<\/em> bestsellers to acclaimed graphic novels to celebrity-narrated audiobooks. Our document reader has been embedded more than 10 million times across the web on sites like <a href=\"https://www.crunchbase.com/organization/newyorktimes\">The New York Times<\/a>, <a href=\"https://www.crunchbase.com/organization/usa-today\">USA Today<\/a>, and <a href=\"https://www.crunchbase.com/organization/techcrunch\">TechCrunch<\/a>.<\/p>\n\n<p>And we&rsquo;re just getting started.<\/p>\n\n<p>Where do you come in? We&rsquo;re a small but mighty team of PhDs, dropouts, open source contributors, amateur bartenders, painters, fiction writers, unicyclists, and musicians, and we&rsquo;re looking for more talented, creative people to join us. If you want to work on a product used (and loved) by millions, come have a tasty, noncommittal beverage of your choice with us.<\/p>\n\n<p>Scribd \\skribbed\\ : Read like you own every book in the world.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><strong>About the Backend&nbsp;Engineer Role<\/strong><\/p>\n\n<p>We're looking for engineers with experience or interest in payments, search, or recommendation.<\/p>\n\n<p>Because this team works on features including recommendations, search, payments and the mobile app API, we use a wide variety of technologies including Ruby on Rails, Go, ElasticSearch, Spark/Hadoop, MySQL, Sphinx, and Redis. Our team boasts several recent accomplishments such as a distributed, scaling, caching image server in Go that processes millions of images a day and a fuzzy matching text filter that can instantly detect two similar, but not identical, passages of text out of a database of all the books in the world.<\/p>\n\n<p><em>Some projects we are currently tackling:<\/em><\/p>\n\n<ul>\n<li>Building the world's best recommendation engine for books (machine learning in Spark, runtime in Ruby and Go). We are working on the book equivalent of Pandora's \"Music Genome Project\": an ambitious project to organize all the books in the world and use it to take book discovery to the next level.<\/li>\n<li>Scaling backend search infrastructure (using technologies like Elasticsearch, Solr, HDFS, Spark, Hive, and Go) to achieve a low latency and high availability search service for our website and our apps.<\/li>\n<li>Improving search quality by implementing and tuning ranking algorithms, indexing schemes, and better search suggestions.<\/li>\n<li>Building well designed and fast API endpoints for our mobile apps (in Ruby and Go).<\/li>\n<li>Migrating our payments system to a new payment gateway and implement new payment methods and features to increase revenue.<\/li>\n<\/ul>\n\n<p><strong>About you<\/strong><\/p>\n\n<ul>\n<li>2-4+ years experience writing and shipping clean code that works<\/li>\n<li>Solid background in algorithms with a focus on applied problem solving<\/li>\n<li>Engineering and Computer Science fundamentals, ideally with a degree in CS, Math, or equivalent experience (dropped out to build your own startup? Great!)<\/li>\n<li><em><em>Bonus points for:<\/em><\/em><\/li>\n<ul>\n<li>strong SQL skills and the ability to analyze large and complex datasets<\/li>\n<li>something that makes you stand out as an engineer, whether it's an impressive side project or open source contribution, competition wins, career accomplishments, academic achievements, or anything else you like to brag about at parties.<\/li>\n<\/ul>\n<\/ul>\n\n<p><strong>Perks and Benefits:<\/strong><\/p>\n\n<ul>\n<li>Competitive salary, generous equity, and full benefits (medical, dental, vision, 401k)<\/li>\n<li>Budget for courses and side projects<\/li>\n<li>Transparency and a flat team structure that cuts down on all that pesky red tape<\/li>\n<li>Three square meals a day, catered from local restaurants<\/li>\n<li>Coffee and Boba Tea runs every afternoon<\/li>\n<li>A MacBook &amp; Thunderbolt display<\/li>\n<li>Company events that include monthly happy hours, ski trips, and trips to local attractions including Safari West and Stinson Beach.<\/li>\n<\/ul>", "publication_date": "2016-03-12T04:24:23.065694Z", "short_name": "infrastructure-engineer-756e2d", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/scribd/infrastructure-engineer-756e2d"}}, {"type": "native", "name": "Beyond Consultant", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}, {"name": "Mid Level", "short_name": "mid"}], "company": {"name": "Bluewolf", "short_name": "bluewolf", "id": 514}, "locations": [{"name": "New York City Metro Area"}], "id": 41166, "categories": [{"name": "Business & Strategy"}], "contents": "<p>Bluewolf was bred a decade ago on the principles of customer focus, transparency and creativity.  Today, we continue to echo those values through our work within some of the fastest-growing and dominant industries in the marketplace.  As we continue to scale at an exciting, rapid rate, we’re constantly looking for engaging and confident individuals to share in our success and contribute their piece to our diverse culture.<\/p>\n<p>Our consultants are resourceful individuals who are interested in expanding their careers as business leaders, critical thinkers and trusted advisors within their professional and personal networks.  He/she is able to lead a vision to execution through analyzing business models and coordinating across multiple resources to deliver technological innovation.  This individual will eventually lead a team to deliver creative technical solutions and optimize business processes to customers by leveraging his/her business acumen, ability to prioritize and manage customer relationships.  Most importantly, our consultants thrive within a collective environment built on camaraderie, maturity and fun - we hope you will feel welcome within our team.<\/p>\n<p><strong>RESPONSIBILITIES<\/strong><\/p>\n<ul>\n<li>Evaluate and manage multiple customer solutions and projects<\/li>\n<li>Manage client budgets vis-a-vis team resources and ROI<\/li>\n<li>Collaborate with and empower team members to brainstorm, solution design and execute projects<\/li>\n<li>Work with different technologies and develop expertise around the Salesforce.com platform<\/li>\n<li>Develop career skills through mentorship and partnering with team leaders<\/li>\n<li>Build consensus across multiple teams - internally and externally<\/li>\n<li>Build and manage long-term client relationship<\/li>\n<\/ul>\n<p><strong>REQUIRED SKILLS<\/strong><\/p>\n<p><strong>Professional:<\/strong><\/p>\n<ul>\n<li>2+ years of professional experience preferred<\/li>\n<li>Project/relationship management experience<\/li>\n<li>Experience with sales force automation technologies and/or the Force.com platform<\/li>\n<\/ul>\n<p><strong>Personal:<\/strong><\/p>\n<ul>\n<li>Ability to learn quickly and think creatively<\/li>\n<li>Ability to quickly assimilate and apply new concepts, business models, and technologies<\/li>\n<li>Ability to effectively facilitate meetings and demonstrate consensus-building skills<\/li>\n<li>Interest in traveling nationally and internationally (25-50%)<\/li>\n<li>Team player with strong interpersonal skills<\/li>\n<li>Possesses excellent oral and written communication skills<\/li>\n<\/ul>\n<p><strong>Optional:<\/strong><\/p>\n<ul>\n<li>Agile methodology or Certified Scrum Master experience<\/li>\n<li>PMP certification<\/li>\n<li>Bachelor’s degree in area(s) related to business and/or technology<\/li>\n<li>Consulting experience<\/li>\n<\/ul>", "publication_date": "2016-03-16T17:23:36.946209Z", "short_name": "beyond-consultant-906f33", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/bluewolf/beyond-consultant-906f33"}}, {"type": "external", "name": "Administrative Coordinator", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}, {"name": "Mid Level", "short_name": "mid"}], "company": {"name": "Gallup", "short_name": "gallup", "id": 809}, "locations": [{"name": "Washington DC Metro Area"}], "id": 37927, "categories": [{"name": "Operations"}], "contents": "<p><strong>Description<\/strong><\/p>\n<ul>\n<li>Will your sophistication and self-confidence enable you to partner effectively with consultants?<\/li>\n<li>Are you a logical, analytical thinker with an eye for proofing information for accuracy and relevance?<\/li>\n<li>Are you an expert with Microsoft Word, Excel and PowerPoint?<\/li>\n<li>Are you a highly responsible and organized professional who can follow through on simultaneous deadlines and get things done with timeliness and perfection?<\/li>\n<li>Can you anticipate needs and ask smart questions to help colleagues get what they need?<\/li>\n<li>Are you a warm, outgoing person who builds friendships and networks easily?<\/li>\n<\/ul>\n<p>The administrative coordinator we are looking for will provide support for meetings, orchestrate special project work and schedule interviews for clients. You will also coordinate and support the efforts of Gallup consultants, taking pride in skillfully managing their calendars, organizing their schedules and travel, and maximizing their efficiency. Other responsibilities could include: preparing documents, assisting with research, copying, binding, shipping, completing expense reports and additional administrative duties as needed. Strong team skills, positive energy, and the ability to be self-directed and proactive are essential to success. You will work in our Washington, D.C., office located downtown at 9th and F streets near the Verizon Center and the Washington Convention Center.<\/p>\n<p><strong>Qualifications<\/strong><\/p>\n<p>Candidates for this position must have expertise in Microsoft Word and proficiency in Microsoft Excel and PowerPoint. Experience with Microsoft Project Management System is beneficial. An associate’s degree or three years of administrative experience is also required.<\/p>\n<p>Applicants must be currently authorized to work in the United States on a full-time basis.<\/p>\n<p>Gallup delivers analytics and advice to help leaders and organizations solve their most pressing problems. Combining more than 80 years of experience with its global reach, Gallup knows more about the attitudes and behaviors of employees, customers, students and citizens than any other organization in the world.<\/p>\n<p>Gallup is an equal opportunity/affirmative action employer that celebrates, supports and promotes diversity and inclusion. We will consider all qualified applicants without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation or gender identity, or any other legally protected basis, in accordance with applicable law.<\/p>", "publication_date": "2016-02-26T20:48:44.665213Z", "short_name": "administrative-coordinator-ee5921", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/gallup/administrative-coordinator-ee5921"}}, {"type": "external", "name": "Video Associate Account Manager", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}, {"name": "Mid Level", "short_name": "mid"}], "company": {"name": "AOL", "short_name": "aol", "id": 57}, "locations": [{"name": "New York City Metro Area"}], "id": 40252, "categories": [{"name": "Creative & Design"}, {"name": "Marketing & PR"}], "contents": "<h5>Company Description<\/h5>\n\n<p>ONE by AOL: Publishers enables the world&apos;s top marketers and media brands to reach consumers across desktop, mobile and TV through programmatic selling and direct campaigns. It is the global partner of choice for leading publishers, advertisers and agencies seeking to maximize the value of their brands online. <\/p>\n\n<p>As more and more viewers turn from traditional TVs to online portals, the way consumers watch videos is changing. ONE by AOL is leading the way with technology that&apos;s evolving with the changing media landscape, monetizing online inventory and providing publishers with tools to sell, optimize and monitor their volume – all in real time.<\/p>\n\n<h5>Job Description<\/h5>\n\n<p>The Video Associate Account Manager will be responsible for supporting the sales team’s efforts to drive client revenue on the publisher platform. You will be expected to support your client’s needs on a daily basis, provide training for self-service publishers, troubleshoot technical and billing issues and identify opportunities for performance growth. You will be expected to develop industry knowledge, utilize internal resources, interface with product and analyst teams and act as a mediator between the advertiser/demand side of the business and our publishers.<\/p>\n\n<p>Simply put, you will be responsible for making customers successful by adding significant value to their business through adoption of the ONE by AOL: Publisher Platform. <\/p>\n\n<p>Key responsibilities include:<\/p>\n\n<p>•   Maintaining strong communication with clients to properly explain platform tools and monetization best practices<\/p>\n\n<p>•    Troubleshooting and solving common technical problems, addressing client issues<\/p>\n\n<p>• Monitoring daily revenue and performance trends of your specific clients to make adequate optimization recommendations as necessary<\/p>\n\n<p>• Maintaining and expanding client relationships; notifying stakeholders about future business opportunities.<\/p>\n\n<p>• Assisting Video Account Management team with any outstanding projects as needed<\/p>\n\n<h5>Qualifications<\/h5>\n\n<p>• 1-3 years of experience in a relevant client management position<\/p>\n\n<p>•    Proven success in managing client relationships and extraordinary client service<\/p>\n\n<p>•    Excellent verbal and written communication skills.<\/p>\n\n<p>•  Experience in online advertising (preferably programmatic video)<\/p>\n\n<p>•    Ability to independently prioritize multiple tasks and meet deadlines in an ever-changing environment <\/p>\n\n<p>•  Strong initiative and ability to work well under pressure while maintaining a positive attitude<\/p>\n\n<p>• Ability to maintain excellent internal and external client relationships<\/p>\n\n<p>•    Proficiency in MS Office Suite with an emphasis in Excel<\/p>\n\n<p>•    BA/BS degree <\/p>\n\n<h5>Additional Information<\/h5>\n\n<p>EEO/AA Women, Minorities, Veterans, Individuals with Disabilities Employer:  AOL offers a competitive salary and benefits package, including 401(k) match and performance bonus. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or other protected category.<\/p>", "publication_date": "2016-03-15T17:44:11.078994Z", "short_name": "video-associate-account-manager-d53b80", "tags": [{"name": "Fortune 1000", "short_name": "fortune-1000-companies"}], "refs": {"landing_page": "https://www.themuse.com/jobs/aol/video-associate-account-manager-d53b80"}}, {"type": "external", "name": "Marketing Manager, Customer Retention ", "model_type": "jobs", "levels": [{"name": "Mid Level", "short_name": "mid"}], "company": {"name": "CarGurus", "short_name": "cargurus", "id": 692}, "locations": [{"name": "Boston Metro Area"}], "id": 40107, "categories": [{"name": "Marketing & PR"}], "contents": "<header class=\"app-header print--hidden ng-scope\" data-ng-controller=\"NavController\">\n<div id=\"st-navBar\" class=\"wrapper\">\n<div class=\"app-header-content\"><a id=\"st-homeLink\" class=\"app-header-logo link--block\" title=\"SmartRecruiters\" href=\"https://www.smartrecruiters.com/app/home\"> <\/a><nav class=\"header-element nav nav--primary\">\n<div class=\"column wide-10of16\">\n<div class=\"job_details-ad bordered--top\">\n<div id=\"st-companyDescriptionContent\" class=\"job_details-content ng-binding\" data-ng-bind-html=\"::details.companyDescription\">\n<div id=\"st-jobDescriptionContent\" class=\"job_details-content ng-binding\" data-ng-bind-html=\"::details.jobDescription\">\n<p>As the Manager of Consumer Retention you will be responsible for evolving and expanding CarGurus&rsquo; consumer offering to increase repeat traffic and long term customer engagement.&nbsp; The successful candidate will be customer-focused almost to a fault, with a passion for bringing together insights, creativity and innovation to make the CarGurus user experience more &ldquo;sticky&rdquo; and valuable for consumers.<\/p>\n<p><strong>Responsibilities<\/strong><\/p>\n<ul>\n<li>Provide thought leadership to optimize and expand CarGurus&rsquo; email marketing and broader customer retention programs<\/li>\n<li>Conceptualize, test and optimize new high-value consumer offerings that enable CarGurus to play a broader role in consumers&rsquo; car ownership cycle, not just the shopping process.<\/li>\n<li>Build programs to increase the percentage of visitors who participate in the CarGurus community by contributing user-generated content.<\/li>\n<li>Partner actively with engineering team to test, measure and optimize new retention-focused site features and optimizations to CarGurus&rsquo; email marketing program.<\/li>\n<li>Work cross-functionally to create or package highly compelling data, editorial content or offers to deepen CarGurus&rsquo; relationship with consumers.<\/li>\n<li>Contribute significantly to making CarGurus the brand of choice for consumers&rsquo; car shopping and ownership needs, driving measurable growth in repeat traffic to the site.<\/li>\n<li>Develop, monitor and optimize Customer Retention KPIs<\/li>\n<\/ul>\n<p>&nbsp;<strong>Requirements:<\/strong><\/p>\n<ul>\n<li>5+ years of comparable marketing/product management experience.<\/li>\n<li>Familiarity with email marketing best practices and/or consumer web product management preferred but not required.<\/li>\n<li>Superior analytic skills and expertise in using data to identify opportunities and measure the success of your programs.<\/li>\n<li>Customer-first mindset &ndash; you&rsquo;re always looking for creative and innovative ways to make the experience better, easier, and more rewarding for consumers.<\/li>\n<li>Strong test-and-learn mentality to get ideas to market quickly and iteratively build on those that show promise<\/li>\n<li>Must be a strong team player that works well in collaborative situations and is comfortable working closely with/through engineering.<\/li>\n<li>Excellent communication and interpersonal skills.<\/li>\n<li>Prior experience in a fast-paced, results-driven environment.<\/li>\n<li>BS/BA from a top school required; MBA a plus.<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/nav><\/div>\n<\/div>\n<\/header>", "publication_date": "2016-03-15T17:47:02.000774Z", "short_name": "marketing-manager-customer-retention", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/cargurus/marketing-manager-customer-retention"}}, {"type": "external", "name": "Retail Sales Associate", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}], "company": {"name": "Peloton Cycle", "short_name": "pelotoncycle", "id": 243}, "locations": [{"name": "San Francisco Bay Area"}], "id": 21330, "categories": [{"name": "Sales"}], "contents": "<p><strong>The Role:<br /><\/strong><br /><span>Energetic, enthusiastic, and results-driven, Peloton Sales Associates are the front line business drivers and brand ambassadors of our communities. Under the direction of the Store Manager, Peloton Associates exhibit a keen knowledge of our product, services, and company. Above all, Peloton Associates possess a strong ability to build rapport and lasting relationships with prospective and&nbsp;<\/span><br /><span>current clients in order to build a solid network for sales.<br /><\/span><br /><strong>Daily Responsibilities:<\/strong><br /><ul><li><span>Drive business to maximize sales through excellent customer service, product knowledge, and merchandise presentation<\/span><\/li><li><span>Possess and enthusiastically communicate knowledge of Peloton&rsquo;s products and brand image<\/span><\/li><li><span>Capture client information and actively develop a client base through CRM, consistently adding information to further promote new and existing relationships<\/span><\/li><li><span>Regularly contact clients regarding new product updates, events and follow up.<\/span><\/li><li><span>Provide outstanding customer service at all times<\/span><\/li><li><span>Adhere to high expectations placed on teamwork and the ability to work professionally with fellow sales associates and clients<\/span><\/li><\/ul><br /><strong>Qualifications:<\/strong><br /><ul><li><span>Prior sales and clientele experience in a luxury goods environment<\/span><\/li><li><span>Enthusiastic, energetic, personable, professional demeanor<\/span><\/li><li><span>Entrepreneurial spirit; confidence to perform on an incentive-based compensation plan<\/span><\/li><li><span>Excellent written and verbal communication skills<\/span><\/li><li><span>Ambitious, hardworking, team-oriented, and deeply passionate about the fitness industry<\/span><\/li><li><span>Highly organized with great follow-up and time management skills.<\/span><\/li><li><span>Self-motivated, able to quickly absorb and communicate technical terminology<\/span><\/li><li><span>Proficiency with MS Software (Word, Excel, etc.), Apple Products, CRM (Customer Relationship Management) a plus&nbsp;<\/span><\/li><\/ul><br /><span><span>Peloton is proud to offer all Associates a competitive base hourly pay with generous commission&nbsp;opportunities, vacation time, sick leave, personal days, and discounts on all Peloton products and services.&nbsp;<span>Peloton is an equal opportunity employer and hires only on the basis of skills and experience.<\/span><br /><\/span><\/span><p><strong><br />About Peloton:<\/strong><\/p><span><span>Founded in 2012, Peloton has transformed the at-home fitness experience by creating a bike that merges high-design with modern technology to provide access to live streaming and on demand indoor cycling classes led by elite instructors. With a state of the art studio, the best instructors and content distribution, Peloton delivers an intense high-energy workout that motivates, while positively changing the mind and body.<\/span><span>&nbsp;<\/span><\/span><br /><br /><\/p>", "publication_date": "2016-01-26T20:30:59.812823Z", "short_name": "retail-sales-associate-778d65", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/pelotoncycle/retail-sales-associate-778d65"}}, {"type": "external", "name": "Senior Account Executive", "model_type": "jobs", "levels": [{"name": "Senior Level", "short_name": "senior"}], "company": {"name": "Outbrain", "short_name": "outbrain", "id": 279}, "locations": [{"name": "New York City Metro Area"}], "id": 31730, "categories": [{"name": "Sales"}], "contents": "<p>Outbrain is seeking a motivated Senior Account Executive ready to make a difference in digital marketing. Entrepreneurially-spirited, this salesperson will be responsible for driving direct revenue by leveraging the industry’s leading content recommendations solutions for brands and advertising agencies in the Eastern U.S. Our team is made up of individuals who are resourceful, bright, and proactive, and who work well both independently and as part of a fast-growing team.<\/p>\n<p><strong>Deliverables:<\/strong><\/p>\n<p>For this position we are committed to finding a consultative dealmaker with the ability to manage existing accounts, source new clients and build a revenue pipeline, turning prospects into partners.<\/p>\n<p><strong>Your first year should look like this:<\/strong><\/p>\n<ul>\n<li>In your first month, you should find your bearings, do a deep dive into the Outbrain product, and start to build key internal and external relationships<\/li>\n<li>After three months, you will be an expert in content marketing and you’ll have mastered our positioning within the digital landscape. You’ll be able to confidently and effectively deliver our pitch, will have already completed a number of in person client meetings and you’ll have a ton of new in person meetings scheduled.<\/li>\n<li>After six months, you will have successfully closed an abundance of new brand and agency business as well have significantly grown a number of key existing accounts<\/li>\n<li>When you finish up your first year, you’ll be an essential part of the East Coast sales team, having substantially increased Outbrain’s market penetration with the key brand and agencies within the region.<\/li>\n<\/ul>\n<p><strong>What you’ll need to be successful:<\/strong><\/p>\n<ul>\n<li>You’re not a fan of display ads, and are passionate about educating brands on a more effective way to engage with their target audience online with content marketing<\/li>\n<li>You read up on digital marketing in your downtime, and know the landscape like the back of your hand (or something you know really, really well)<\/li>\n<li>You understand how to think consultatively, and can sell our multiple solutions without confusing the overall product messaging<\/li>\n<li>You are not satisfied unless you are actively hunting and closing new business<\/li>\n<li>Account managers are your best friends- you thrive off collaboration<\/li>\n<li>You’re flexible, and don’t mind hopping on a plane for a last minute meeting or conference<\/li>\n<li>Excel doesn’t make you sweat- analyzing campaign analytics and metrics will come naturally  <\/li>\n<li>You know the birthdays and favorite colors of contacts at the top brands, agencies and publishers in the NY and East Coast market<\/li>\n<\/ul>", "publication_date": "2016-01-08T09:02:58.493479Z", "short_name": "senior-account-executive-970482", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/outbrain/senior-account-executive-970482"}}, {"type": "external", "name": "Marketing Analyst", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}, {"name": "Mid Level", "short_name": "mid"}], "company": {"name": "Squarespace", "short_name": "squarespace", "id": 46}, "locations": [{"name": "New York City Metro Area"}], "id": 39804, "categories": [{"name": "Finance & Data"}], "contents": "<p>Do you enjoy tackling big, integrative questions in creative ways? Do you love turning data into action? Are you an independent, self-motivated, analytical thinker? If so, we want you to join our Analytics team to help us apply rigorous analysis to Squarespace&rsquo;s biggest opportunities. Our team excels at structuring complex problems, finding the key drivers, and delivering actionable recommendations. You will join us in building the models, dashboards, and tools that drive change across the company.<\/p>\n\n<p>We are currently seeking a Marketing Analyst who demonstrates sharp intellectual curiosity, a collaborative work ethic, and expertise in assessing marketing effectiveness.<br /><br />We expect that you will build meaningful relationships across the Marketing team and provide them with the tools and analytical frameworks needed to guide their decision making. As a trusted partner, you will help define what success looks like and how to track it.<\/p>\n\n<p>Questions you may tackle in a typical day include:<\/p>\n\n<ul>\n<li><span style=\"font-size: 13px;\">Which touchpoints in the customer journey should we track, what should we record at each step, and how can we build that into an insightful attribution framework(s)?<\/span><\/li>\n<li>What kinds of tests should we be running to assess efficacy of media channels, marketing copy, across geographies, etc.?<\/li>\n<li>How can we tease out the effectiveness of hard-to-track media like TV?<\/li>\n<li>In which markets are we under-indexed and which media will allow us to penetrate them?<\/li>\n<\/ul>\n\n<p>The emphasis is on building domain expertise, communicating findings, and developing ways to help Marketing be more effective with the data they use every day. We relentlessly seek better ways to solve problems and improve existing processes. Be ready to learn by doing and to teach what you learn.<\/p>\n\n<p><strong>Requirements<\/strong><\/p>\n\n<ul>\n<li><span style=\"font-size: 13px;\">Significant experience in sophisticated marketing analytics (e.g. attribution frameworks, media mix modeling, cohort analysis, etc.)<\/span><\/li>\n<li>Skill with a major programming language (Python, C++, Java) and/or analytics tool (Pandas, R, SQL, Excel) is a strong plus<\/li>\n<li>Statistical competence a plus (e.g. A/B testing, regression modeling, etc.)<\/li>\n<\/ul>\n\n<p dir=\"ltr\"><strong>About Squarespace<\/strong><\/p>\n\n<p dir=\"ltr\">Squarespace provides creative tools and services to help anyone build and manage their brand online. For more than a decade, we&rsquo;ve empowered millions of people &mdash; from individuals and local artists to entrepreneurs building the world&rsquo;s most iconic businesses &mdash; to take control of their online presence like never before. By blending elegant design and sophisticated engineering, Squarespace sets the new standard for modern publishing.<\/p>\n\n<p dir=\"ltr\">Squarespace&rsquo;s team of more than 500 is headquartered in downtown New York City, with offices in Dublin and Portland. For more information, visit <a href=\"http://www.squarespace.com/about\" target=\"_blank\">www.squarespace.com/about<\/a>.<\/p>\n\n<p dir=\"ltr\"><em>Squarespace values diversity and seeks employees with great ideas, regardless of their race, religion, ancestry, gender, gender identity or expression, sexual orientation, age, marital status, disability or Veteran status. We are proud to be an equal opportunity workplace.<\/em><\/p>\n\n<p>&nbsp;<\/p>", "publication_date": "2016-03-09T19:36:16.311997Z", "short_name": "marketing-analyst-4cb2f2", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/squarespace/marketing-analyst-4cb2f2"}}, {"type": "external", "name": "Intern - Summer - UX/UI Design", "model_type": "jobs", "levels": [{"name": "Internship", "short_name": "internship"}], "company": {"name": "priceline.com", "short_name": "pricelinecom", "id": 374}, "locations": [{"name": "New York City Metro Area"}], "id": 29015, "categories": [{"name": "Creative & Design"}], "contents": "<p>Priceline is seeking a thoughtful and excited design intern to join the flights team this summer. Our mission is simple &ndash; To deliver the best travel deals for our customers where, when, and how they want them.<\/p>\n\n<p>Description:<\/p>\n\n<p>As a design intern on the flights team, you will work side-by-side a team of designers, developers, and product owners to help create a world-class flight booking experience. Besides working with a design mentor, at priceline.com, you will also join a large group of summer interns and have an opportunity to be a part of company wide intern events including lunch and learns, team building, and a fun outing to an NYC event.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Responsibilities:<\/p>\n\n<ul><li>You will be treated similarly to a &nbsp;junior designer and will be involved in the whole design process... from wireframes to prototypes to high-fidelity comps to writing design specs for the developers.<\/li><li>Work closely with other designers, product owners, and developers to define user issues and come up with the best solutions.<\/li><li>Maintain visual guidelines to ensure consistent representation of Priceline&rsquo;s brand.<\/li><\/ul>\n\n<p>&nbsp;<\/p>\n\n<p>What we&rsquo;re looking for in a design intern:<\/p>\n\n<ul><li>Internships are a learning experience! We&rsquo;re looking for someone who has an open mind and is ready to learn about being an in-house UX/UI designer.<\/li><li>You should be abundantly curious, welcome feedback, and be a dreamer of ideas.<\/li><li>You are a go-getter, can be resourceful, and work independently.<\/li><li>Good communication skills! You will join a collaborative team and will need to communicate your designs to your fellow teammates.<\/li><li>Working towards a degree in graphic design, communications design, interaction design, or other similar design field.<\/li><li>A portfolio with great examples of design work (a huge plus if you have a web/mobile design project).<\/li><li>Strong skills with Adobe CS.<\/li><\/ul>\n\n<ul><li>A love of travel!<\/li><\/ul>", "publication_date": "2016-01-26T20:30:23.218771Z", "short_name": "intern-summer-uxui-design-0db8e8", "tags": [{"name": "Fortune 1000", "short_name": "fortune-1000-companies"}], "refs": {"landing_page": "https://www.themuse.com/jobs/pricelinecom/intern-summer-uxui-design-0db8e8"}}, {"type": "external", "name": "Sourcer - R4R", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}], "company": {"name": "Facebook", "short_name": "facebook", "id": 659}, "locations": [{"name": "Silicon Valley, CA"}], "id": 41130, "categories": [{"name": "HR & Recruiting"}], "contents": "<p>Facebook was built to help people connect and share, and over the last decade our tools have played a critical part in changing how people around the world communicate with one another. With over a billion people using the service and more than fifty offices around the globe, a career at Facebook offers countless ways to make an impact in a fast growing organization.<br />\nRecruiting is a core strategic driver of Facebook’s success. We have a world-class team working together to help drive our ambitions and scale to the next level. In this effort, we are looking for a Sourcer to join our team based in Menlo Park, CA. This full time position reports directly into the R4R Recruiting Lead and will be responsible for sourcing recruiting resources (R4R) across US teams focused on Tech, Global Marketing Solutions and Business.<\/p>\n<p><strong>Responsibilities<\/strong><\/p>\n<ul>\n<li>Work closely with hiring managers and recruiters to develop and execute tactical sourcing strategies aimed at generating a pipeline of top recruiters and soucers.<\/li>\n<li>Identify potential candidates through the use of intricate Boolean searches, user groups, candidate referrals and networking.<\/li>\n<li>Engage, develop relationships with, and assist candidates through the recruitment process. Develop and lead projects and initiatives to increase candidate pipeline.<\/li>\n<li>Partner with hiring managers to identify skill sets for niche roles and develop candidate pipelines for target skill sets.<\/li>\n<li>Ensure data integrity within Facebook’s Applicant Tracking System.<\/li>\n<li>Partner and collaborate with other sourcers to ensure that leads are shared with those who can best develop them.<\/li>\n<\/ul>\n<p><strong>Requirements<\/strong><\/p>\n<ul>\n<li>Minimum of 2 years sourcing experience with large or growing tech organizations.<\/li>\n<li>Broad experience through all aspects of the recruitment process.<\/li>\n<li>Ability to effectively influence and communicate cross-functionally.<\/li>\n<li>Creativity in problem-solving, resourcefulness, ability to be detail-oriented, strong organizational skills.<\/li>\n<li>Experience partnering with recruiters and hiring managers on hiring initiatives.<\/li>\n<li>Passionate about Facebook and knowledge of the product and business.<\/li>\n<\/ul>", "publication_date": "2016-03-16T17:21:03.091791Z", "short_name": "sourcer-r4r-0ebc99", "tags": [{"name": "Fortune 1000", "short_name": "fortune-1000-companies"}], "refs": {"landing_page": "https://www.themuse.com/jobs/facebook/sourcer-r4r-0ebc99"}}, {"type": "external", "name": "Marketing Specialist - Acquisition and Retention", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}, {"name": "Mid Level", "short_name": "mid"}], "company": {"name": "SmartBrief", "short_name": "smartbrief", "id": 699}, "locations": [{"name": "Washington DC Metro Area"}], "id": 40446, "categories": [{"name": "Marketing & PR"}], "contents": "<p><strong>Job Summary:<\/strong><br />\nThe Marketing Specialist is responsible for planning and executing campaigns that grow and engage SmartBrief’s audience of business decision-makers.  He or she will develop email programs, manage paid campaigns and collaborate with internal teams to plan and execute content and social strategies.<\/p>\n<p>Since 1999, SmartBrief has provided industry news to business professionals in 15 vertical markets.  As Marketing Specialist, you’ll get a chance to make a real impact on the way we communicate with readers and market to market to potential subscribers.<\/p>\n<p>We’re headquartered in Washington, DC with an office in NY. Find out what it’s like to work at SmartBrief by checking out our Muse profile: https://www.themuse.com/companies/smartbrief<\/p>\n<p><strong>Primary Responsibilities:<\/strong><\/p>\n<ul>\n<li>Develop audience-specific copy and coordinate with Design on graphics, landing page design, email templates and other creative assets.<\/li>\n<li>Execute email programs for subscriber acquisition and retention in the Salesforce Marketing Cloud (Exact Target).  Manage lists, set up messages and landing pages, make use of triggers and automation, and work with development to improve integration with internal systems.<\/li>\n<li>Manage paid campaigns and make recommendations to improve conversion and maximize ROI.<\/li>\n<li>Coordinate internal promotions across SmartBrief’s portfolio of e-mail newsletters and website.<\/li>\n<li>Create and administer A/B tests: analyze results and modify campaigns to improve conversion rates.<\/li>\n<li>Assist with developing marketing and branding strategies for SmartBrief.<\/li>\n<li>Build relationships with internal SmartBrief teams including Sales, Tech, and Editorial to identify and execute opportunities to grow audience and improve engagement.<\/li>\n<li>Create and run reports that track campaign results against goals.<\/li>\n<\/ul>\n<p><strong>Desired Skills and Experience:<\/strong><\/p>\n<ul>\n<li>2 - 3 years of online marketing experience, including 1-year of email experience.  Expertise with Exact Target / Salesforce Marketing Cloud or another email marketing platform is highly preferred.<\/li>\n<li>Demonstrated ability to manipulate and analyze data, communicate insights, and use results to improve campaign performance.<\/li>\n<li>Entrepreneurial outlook and strong work ethic. Ability to forge productive relationships across departments and organizations.<\/li>\n<li>Familiarity with a variety of digital marketing channels including display, social, and pay-per-click (PPC).<\/li>\n<li>Legal right to work in the United States.<\/li>\n<li>Prior experiences with a media company is helpful but not required.<\/li>\n<\/ul>\n<p><strong>Skills/Abilities:<\/strong><\/p>\n<ul>\n<li>Strong planning and organizational skills. Ability to manage multiple projects simultaneously.<\/li>\n<li>Excellent copywriting skills.<\/li>\n<li>Working knowledge of HTML/CSS and graphic design. Bonus points for experience with Photoshop and Dreamweaver.<\/li>\n<li>Proficient in Microsoft Word, PowerPoint and advanced Excel skills.<\/li>\n<\/ul>", "publication_date": "2016-03-15T15:00:41.383843Z", "short_name": "marketing-specialist-acquisition-and-retention-61c561", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/smartbrief/marketing-specialist-acquisition-and-retention-61c561"}}, {"type": "external", "name": "Account Executive/Senior Account Executive, Field Sales - Chicago", "model_type": "jobs", "levels": [{"name": "Mid Level", "short_name": "mid"}, {"name": "Senior Level", "short_name": "senior"}], "company": {"name": "Quantcast", "short_name": "quantcast", "id": 708}, "locations": [{"name": "Chicago, IL"}], "id": 38170, "categories": [{"name": "Sales"}], "contents": "<div>Quantcast, a revolutionary audience intelligence and addressable advertising service, has aggressive plans for expanding its field sales team.<\/div>\n\n<div>&nbsp;<\/div>\n\n<div>This individual will be part of a team responsible for calling on and working with top-tier agencies and their online advertising clients. He/She will be expected to build upon the successes of existing customers and to develop new relationships with the industry’s top marketing minds. This individual will be based in our office in Chicago and covering Chicago/Midwest sales territories.&nbsp;<\/div>\n\n<p><strong>Responsibilities<\/strong><ul><li>Source and close new business to regularly meet and exceed sales goals.<\/li><li>Build an intimate understanding of Quantcast products and their place in the industry.<\/li><li>Build agency/direct client relationships with senior level executives.<\/li><li>Reach out to potential clients, perform in person presentations to media professionals, create RFP’s, and close accounts.&nbsp;&nbsp;<\/li><li>Track and manage sales pipeline and account activities in Salesforce.com.<\/li><li>Deliver product feedback to operations leaders to ensure the voice of the customer is part of Quantcast’s DNA.<\/li><li>Manage new and existing client campaigns to successfully meet and exceed client performance expectations.&nbsp; Share expertise and advise clients on new campaign ideas to generate continued results.<\/li><li>Work with internal account management and ad operations to ensure client satisfaction.<\/li><li>Participate in industry events and conferences.<\/li><\/ul><\/p>\n<p><strong>Requirements<\/strong><ul><li>5-10 years sales experience in online advertising.<\/li><li>Outgoing and adept at creating professional relationships.&nbsp; Direct and agency contacts at both senior and junior levels is a plus.<\/li><li>Experience in audience-based selling of digital media is ideal.<\/li><li>Strong understanding of fundamentals of online advertising processes and technology.<\/li><li>Active in industry trade and networking events.&nbsp;<\/li><li>Bachelors Degree or equivalent experience.<\/li><li>Exceptional communication skills (both verbal and written).<\/li><li>Strong attention to detail and ability to QA own work.<\/li><li>Hunter mentality, tenacity, and ability to “think on your feet.”<\/li><li>Ability to work in a fast-paced and dynamic environment.<\/li><li>Adept at using MS Office products and Salesforce.com.&nbsp;<\/li><\/ul><\/p>\n<div>Quantcast helps create a more personalized digital world. We have built one of the world’s most sophisticated data-intelligence platforms, utilizing big data and machine learning to solve the biggest challenges in marketing and create more rewarding experiences across the digital landscape. Publishers use our insights to better understand audiences and how content resonates with consumers they want to attract and retain. Marketers utilize our understanding of online behavior and our predictive advertising capabilities to reach the customers likeliest to engage with their messages. Consumers see the results of our work in relevant stories and advertisements that create a personalized experience across all of their devices.&nbsp;<\/div>\n\n<div><br><\/div>\n\n<div>Quantcast was honored as a Glassdoor Best Place to Work in 2016. To learn more, follow&nbsp;<a href=\"http://qc.st/followus-glassdoor\" class=\"postings-link\">Quantcast on Glassdoor<\/a>.<\/div>", "publication_date": "2016-03-11T03:27:01.327339Z", "short_name": "account-executivesenior-account-executive-field-sales-chicago-9addf3", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/quantcast/account-executivesenior-account-executive-field-sales-chicago-9addf3"}}, {"type": "native", "name": "Associate Digital Strategist", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}], "company": {"name": "Grafik", "short_name": "grafik", "id": 608}, "locations": [{"name": "Alexandria, VA"}], "id": 26652, "categories": [{"name": "Marketing & PR"}], "contents": "<p>Digital is in your DNA. You’re as comfortable conducting a heuristic analysis of a website as you are diving into clickstream and advertising analytics. You understand the value of marketing automation and can help clients devise an inbound marketing strategy that drives brand engagement. You’re a strategic and creative thinker who loves solving complex problems through the application of brand strategy and marketing technology.<\/p>\n<p><strong>Qualities and Characteristics<\/strong><\/p>\n<ul>\n<li>Client focused<\/li>\n<li>Ability to build trust and nurture strong relationships<\/li>\n<li>Dedicated to excellence, a deep commitment to attention to detail <\/li>\n<li>Team oriented and highly collaborative<\/li>\n<li>Strong work ethic, willing to go the extra mile when necessary<\/li>\n<\/ul>\n<p><strong>Required Skills<\/strong><\/p>\n<ul>\n<li>Two plus years experience in digital marketing<\/li>\n<li>Deep understanding of content management, customer relationship management (CRM), and marketing automation platforms<\/li>\n<li>Strong analytic skills with the ability to conduct thoughtful research online and off<\/li>\n<li>Hands on experience with Google Analytics, Google AdWords, and SEO tools<\/li>\n<li>Excellent writing ability, capable of crafting insightful, personalized client briefs<\/li>\n<\/ul>\n<p><strong>Required Education<\/strong><\/p>\n<p>Bachelors Degree<\/p>\n<p><strong>Preferred Skills<\/strong><\/p>\n<ul>\n<li>Google Analytics Certified<\/li>\n<li>Google AdWords Certified<\/li>\n<li>Hubspot Inbound Marketing Certification<\/li>\n<li>Hubspot Design Certification<\/li>\n<li>Working knowledge of HTML/CSS/JavaScript <\/li>\n<\/ul>", "publication_date": "2015-10-26T20:57:31.724453Z", "short_name": "associate-digital-strategist-ae7767", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/grafik/associate-digital-strategist-ae7767"}}, {"type": "external", "name": "Internal Auditor", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}, {"name": "Mid Level", "short_name": "mid"}], "company": {"name": "Mohawk Industries", "short_name": "mohawkindustries", "id": 667}, "locations": [{"name": "Calhoun, GA"}], "id": 26787, "categories": [{"name": "Business & Strategy"}, {"name": "Finance & Data"}, {"name": "Operations"}], "contents": "<p>Are you Mohawk Material? We’re the biggest and the best flooring company in the world, and we are looking for the best Professionals to support our continued growth! At Mohawk there are always opportunities for high performing Professionals to excel! Are you the best? If so show us what you are made of and come build your career with us<\/p>\n<p>Performs professional internal auditing work.  Work involves conducting performance, financial, information systems, fraud and compliance audit projects; providing consulting services to the organization’s management and staff; and providing input to development of the annual audit plan.  Maintains all organizational and professional ethical standards.  Works under limited supervision (including work review by Senior Auditors) with moderate latitude for initiative and independent<\/p>\n<p><strong>Responsibilities:<\/strong><\/p>\n<ul>\n<li>Performs assigned audits in a professional manner and in accordance with the approved audit program.<\/li>\n<li>Develops the audit program for assigned audits with no existing audit program. <\/li>\n<li>Performs audit steps and project tasks under  limited supervision.<\/li>\n<li>Supervises and reviews the documentation, results and conclusions of tasks performed by junior internal auditors ensuring the success and professional standards of the assignment. <\/li>\n<li>Evaluates the adequacy of internal controls and compliance with company policies and procedures by conducting interviews with all levels of personnel, examining transactions, documents, records and reports, and observing procedures.<\/li>\n<li>Identifies and defines issues and reviews and analyzes evidence.<\/li>\n<li>Prepares working papers, which record and summarize data on the assigned audit segment, in accordance with professional standards.<\/li>\n<li>Assists in recommendations based on independent judgment of corrective action and suggested improvements to operations and reductions in cost.<\/li>\n<li>Writes audit reports for distribution to management and senior management documenting the results of the audit.<\/li>\n<li>Develops and maintains productive client and staff relationships through individual contacts and group meetings.<\/li>\n<li>Pursues and is responsible for assuring compliance with the department’s annual requirements of professional development through external and internal training and professional association memberships.<\/li>\n<li>Represents internal audit on organizational project teams, at management meetings and with external organizations.<\/li>\n<li>Adheres to all organizational and professional ethical standards.<\/li>\n<li>Performs other duties as assigned by the Internal Audit Manager and/or General Auditor/Director of Internal Audit.<\/li>\n<\/ul>\n<p><strong>Qualifications:<\/strong><\/p>\n<ul>\n<li>BS or BA degree in Accounting, Finance or Business with emphasis in accounting desirable and two years of full-time experience in auditing, accounting or business analysis.<\/li>\n<li>A graduate degree in business or a professional certification such as CPA, CIA, or CISA may each substitute for one year of required experience with a maximum substitution of two years.<\/li>\n<li>If professional certification has not been attained, active pursuit of CPA, CIA, or CISA certification with completion within one year of employment in “internal auditor” class.<\/li>\n<\/ul>\n<p><strong>Competencies:<\/strong><\/p>\n<ul>\n<li>Knowledge of and skill in applying internal auditing and accounting principles and practices, and management principles and preferred business practices.<\/li>\n<li>Knowledge of the Standards for the Professional Practice of Internal Auditing and the Code of Ethics developed by The Institute of Internal Auditors. <\/li>\n<li>Knowledge of industry program policies, procedures, regulations and laws.<\/li>\n<li>Skill in conducting quality control reviews of all products of audit work.<\/li>\n<li>Skill in collecting and analyzing complex data, evaluating information and systems, and drawing logical conclusions.<\/li>\n<li>Skill in planning and project management, and in maintaining composure under pressure while meeting multiple deadlines.<\/li>\n<li>Skill in negotiating issues and resolving problems.<\/li>\n<li>Skill in using a computer with word processing, spreadsheet, and other business software to prepare reports, memos, summaries and analyses.<\/li>\n<li>Skill in effective verbal and written communications, including active listening skills and skill in presenting findings and recommendations in a clear and concise manner.<\/li>\n<li>Ability to establish and maintain harmonious working relationships with co-workers, staff and external contacts, and to work effectively in a professional team environment.<\/li>\n<li>Ability to travel (up to 30%).<\/li>\n<\/ul>\n<p>Mohawk Industries is the leading global flooring manufacturer that creates products to enhance residential and commercial spaces around the world. Mohawk’s vertically integrated manufacturing and distribution processes provide competitive advantages in the production of carpet, rugs, ceramic tile, laminate, wood, stone and vinyl flooring. Our industry-leading innovation has yielded products and technologies that differentiate our brands in the marketplace and satisfy all remodeling and new construction requirements. Our brands are among the most recognized in the industry and include American Olean, Bigelow, Daltile, Durkan, Karastan, Lees, Marazzi, Mohawk, Pergo, Unilin, Quick-Step and IVC. During the past decade, Mohawk has transformed its business from an American carpet manufacturer into the world’s largest flooring company with operations in Australia, Brazil, Canada, Europe, India, Malaysia, Mexico, New Zealand, Russia and the United States.<\/p>", "publication_date": "2015-10-28T16:49:23.057716Z", "short_name": "internal-auditor-94a3e2", "tags": [{"name": "Fortune 1000", "short_name": "fortune-1000-companies"}], "refs": {"landing_page": "https://www.themuse.com/jobs/mohawkindustries/internal-auditor-94a3e2"}}, {"type": "native", "name": "Freelance Shoot Coordinator - San Francisco", "model_type": "jobs", "levels": [{"name": "Mid Level", "short_name": "mid"}], "company": {"name": "The Muse", "short_name": "themuse", "id": 672}, "locations": [{"name": "San Francisco Bay Area"}], "id": 28669, "categories": [{"name": "Creative & Design"}, {"name": "Project & Product Management"}], "contents": "<p>The Muse is looking for a Shoot Coordinator located in San Francisco to film company offices on a Freelance basis. The freelancer would also need to upload footage to our servers within 48 hours of the shoot, and has the potential to edit their own work to be showcased on company profiles like these: <\/p>\n<ul>\n<li><a href=\"http://www.themuse.com/companies/bloomberg\">Bloomberg<\/a><\/li>\n<li><a href=\"http://www.themuse.com/companies/dropbox\">Dropbox<\/a><\/li>\n<li><a href=\"http://www.themuse.com/companies/marriottinternational\">Marriott International<\/a><\/li>\n<\/ul>\n<p><strong>Why we will love you<\/strong><\/p>\n<ul>\n<li>You have a passion for film production and experience working as a freelancer.<\/li>\n<li>You have a show reel<\/li>\n<li>You have studied Film &amp; TV production and ideally have 1 to 3 years of production experience<\/li>\n<li>You are comfortable being a one-man team, traveling to remote shoots, interviewing strangers on a daily basis<\/li>\n<li>You love film production and want a future career as a producer<\/li>\n<li>You have equipment such as a camera, microphones, and lights<\/li>\n<li>You enjoy being organized and handling all steps of the production process—from shooting to editing<\/li>\n<li>You’re known for being detail-oriented and rarely let things fall through the cracks<\/li>\n<li>You have great energy to suggest improvements to the production experience<\/li>\n<li>You have a strong ability to work independently and with others to prioritize and resolve issues.<\/li>\n<\/ul>\n<p>If you’re excited about this opportunity, please submit your show reel and portfolio. We will not accept application without show reels. We'd love to hear a bit about your experience. We look forward to talking with you!<\/p>", "publication_date": "2015-11-19T16:15:25.629545Z", "short_name": "freelance-shoot-coordinator-san-francisco-5b9e68", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/themuse/freelance-shoot-coordinator-san-francisco-5b9e68"}}, {"type": "external", "name": "Associate Real Estate Agent - Chicago (South Suburbs)", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}], "company": {"name": "Redfin", "short_name": "redfin", "id": 769}, "locations": [{"name": "Chicago, IL"}], "id": 34945, "categories": [{"name": "Sales"}], "contents": "<p>Redfin is a new kind of real estate brokerage that puts clients first, making buying and selling a home faster, easier, and more efficient. We believe that real estate should be built on exceptional client service and advocacy. Whether finding the perfect home or getting the best deal, our clients are the backbone of everything we do.<\/p>\n\n<p>As a Redfin Associate Agent, you are an independent contractor who conducts field events for our deal-writing agents&rsquo; clients. You will be paid per event, including home tours and open houses. You own your own schedule and you can work as much or as little as you'd like, provided we've got the demand in your area.<\/p>\n\n<p><strong>Who You Are<\/strong><\/p>\n\n<ul><li><strong>Fire in the belly:<\/strong> you&rsquo;re excited to change the industry for the better and you come to work every day ready to go<\/li><li><strong>Ethical: <\/strong>you always do the right thing<\/li><li><strong>Real estate chops:<\/strong> you're a licensed agent ready to hang your license with us<\/li><li><strong>Tech-savvy: <\/strong>you love technology - you're addicted to email, social media, and your smart phone<\/li><li><strong>Customer-focused: <\/strong>you&rsquo;re a customer advocate, a diplomat, and you always keep it professional<\/li><li><strong>Intelligent: <\/strong>you are articulate and can communicate clearly. You think on your feet and you're quick to react to clients' changing needs<\/li><li><strong>Local knowledge:<\/strong> you know your community like the back of your hand<\/li><li><strong>Prompt:<\/strong> you&rsquo;re on the ball. Early is on time<\/li><\/ul>\n\n<p><strong>What You&rsquo;ll Need<\/strong><\/p>\n\n<ul><li>A reliable mode of transportation<\/li><li>A real estate license and willingness to join local MLS<\/li><li>A smartphone, a laptop, and a GPS - or the willingness to get them<\/li><\/ul>\n\n<p><b><span>HIRING SOON<\/span><\/b><span>! We&rsquo;re not hiring yet, but we will be in touch as soon as the position is open.<\/span><br /><br />Redfin is an equal opportunity employer.<\/p>\n\n<p><br /><br /><\/p>", "publication_date": "2016-02-06T17:33:59.999564Z", "short_name": "associate-real-estate-agent-chicago-south-suburbs-5eeee8", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/redfin/associate-real-estate-agent-chicago-south-suburbs-5eeee8"}}, {"type": "external", "name": "JAVA - Senior Developer", "model_type": "jobs", "levels": [{"name": "Mid Level", "short_name": "mid"}], "company": {"name": "Maven Wave", "short_name": "mavenwave", "id": 845}, "locations": [{"name": "Chandigarh, India"}], "id": 37778, "categories": [{"name": "Engineering"}], "contents": "<p><span>At Maven Wave, we are relentless in hiring the industry’s top talent. Each employee is hand-<\/span><span>picked not only for their skills, but for their personality and broad expertise. We are looking for this <\/span><span>rare combination of talent that sets us apart in the industry.<\/span><br /><br /><span>Founded in 2008, Maven Wave has experienced rapid growth. We combine the experience and <\/span><span>knowledge of a management consulting firm with the innovation and technology expertise of a <\/span><span>cloud services firm, providing a truly unique work environment. Employees have the opportunity <\/span><span>to gain invaluable experience and make a significant impact on the business outcomes of our <\/span><span>clients and our company.<\/span><br /><br /><span>On June 1st, we were named #2 on Crain's Fast 50 List for 2014, and NABR also just <\/span><span>announced us as one of Chicago's 101 Best and Brightest Companies to work for. If you are a <\/span><span>top-performing consulting professional looking to accelerate your career and gain rewarding <\/span><span><span><span>experience, now is the time to join Maven Wave.  <\/span><\/span><\/span><p><span><br />Required Skills:<\/span><\/p><ol><li><p><span>Must have experience with following languages / tools / technologies:<\/span><\/p><\/li><ol><li><p><span>Java, JEE, JDBC<\/span><\/p><\/li><li><p><span>Spring (DI, MVC, Security - LDAP/AD)<\/span><\/p><\/li><li><p><span>JUnit / Test NG , Mockito (or other mocking libraries)<\/span><\/p><\/li><li><p><span>Build tools - Maven 3 and Ant<\/span><\/p><\/li><li><p><span>Experience with JEE Application Servers - WebLogic preferred<\/span><\/p><\/li><li><p><span>Good understanding of HTTP protocol<\/span><\/p><\/li><li><p><span>Design Patterns and SOLID principles<\/span><\/p><\/li><li><p><span>Experience working with Linux environments - Ubuntu, CentOS<\/span><\/p><\/li><li><p><span>Experience working with RDMS - Oracle preferred<\/span><\/p><\/li><li><p><span>Eclipse IDE <\/span><\/p><\/li><li><p><span>Understanding of version control with Subversion and Git source control managers.<\/span><\/p><\/li><li><p><span>Experience with end-to-end software development flows<\/span><\/p><\/li><\/ol><li><p><span>5+ years experience designing and developing Java enterprise applications.<\/span><\/p><\/li><li><p><span>Desirable to have experience working in an Agile environments, Agile concepts and practices such as Refactoring / Continuous Integration / Continuous Testing (TDD, BDD) <\/span><\/p><\/li><li><p><span>Appreciation of how TDD impacts the code quality and design aspects<\/span><\/p><\/li><li><p><span>Strong verbal and written communication skills with other developers and other project stakeholders<\/span><\/p><\/li><li><p><span>Time management skills and ability to multitask<\/span><\/p><\/li><li><p><span>Proactive attitude with a consistent bias to action<\/span><\/p><\/li><\/ol><div><div><div><div><div><div><div><div><div><div<\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><span><span><br /><\/span><\/span><\/p>", "publication_date": "2016-02-26T21:23:37.545162Z", "short_name": "java-senior-developer-5f02ef", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/mavenwave/java-senior-developer-5f02ef"}}, {"type": "external", "name": "Functional Lead", "model_type": "jobs", "levels": [{"name": "Mid Level", "short_name": "mid"}], "company": {"name": "Appian", "short_name": "appian", "id": 706}, "locations": [{"name": "Washington DC Metro Area"}], "id": 39750, "categories": [{"name": "Business & Strategy"}], "contents": "<p><span>As a Functional Lead at Appian, you will be a key leader for the federal acquisition consulting practice, as well as influential in shaping the acquisition process and implantation of Appian for our clients. &nbsp;Appian&rsquo;s growth trajectory ensures that the Functional Lead will immediately impact customer interaction and team development, becoming the business process expert within the federal acquisition group. <\/span><\/p>\n\n<p><b><b><br /><\/b><\/b><p><span style=\"text-decoration: underline;\"><strong>Professional Services Team<br /><\/strong><\/span>Location: Reston, VA&nbsp;<br />Travel: 15-20%<\/p><p><strong>About you:<\/strong><\/p><ul><li><p><span>You have an excellent understanding of Federal Acquisition Regulation (FAR), Defense Federal Acquisition Regulation Supplement (DFARS), government policies and practices. <\/span><\/p><\/li><li><p><span>You have previous experience supporting federal contracting activity as any of the following: government 1102 (strongly preferred, especially with the DoD), contractor support, functional support for contracting application.<\/span><\/p><\/li><li><p><span>You have the ability to analyze regulatory changes and determine their impact on projects<\/span><\/p><\/li><li><p><span>Software consulting experience (Portal, BPM, DM, EAI, etc) <\/span><span>with complete lifecycle implementations is a plus<\/span><\/p><\/li><li><p><span>You have the ability to develop and lead detailed solutions for complex projects.<\/span><\/p><\/li><li><p><span>You are well educated, with at least a BA in addition to 5+ years of experience <\/span><\/p><\/li><\/ul><b><b><br /><\/b><\/b><p><strong>How you&rsquo;ll contribute:<\/strong><\/p><ul><li><p><span>Maintain knowledge and understanding of Federal Acquisition Regulation (FAR) policies and practices as they change.<\/span><\/p><\/li><li><p><span>Independently interface with client technical teams and business owners as needed during the design and implementation<\/span><\/p><\/li><li><p><span>Work directly with project stakeholders throughout the entire life-cycle of projects to define, design, and implement business process based solutions<\/span><\/p><\/li><li><p><span>Provide functional application leadership and guidance to customers regarding &ldquo;best practices&rdquo; through all phases of the Appian implementation.<\/span><\/p><\/li><li><p><span>Ability to develop and lead detailed solutions for complex projects.<\/span><\/p><\/li><\/ul><b><b><br /><\/b><\/b><p><strong>More about Appian:<\/strong><\/p><p><span>At Appian, you will help us build our award-winning PaaS product that enables business people to build cloud and mobile enterprise applications with flexible, visual models instead of custom code. Appian discovers and unites enterprise data, connects users through social and collaborative engagement in the context of business data, and provides the leading suite of business process technology to enable rapid application development and optimization in every industry.<br /><br /><span>#LI-CS1<\/span><br /><\/span><\/p><\/p>", "publication_date": "2016-03-09T16:58:06.637138Z", "short_name": "functional-lead-950204", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/appian/functional-lead-950204"}}, {"type": "external", "name": "Customer Service Representative (fluent in Spanish/English)", "model_type": "jobs", "levels": [{"name": "Entry Level", "short_name": "entry"}], "company": {"name": "AppFolio", "short_name": "appfolio", "id": 810}, "locations": [{"name": "Dallas/Ft. Worth, TX"}], "id": 39755, "categories": [{"name": "Customer Service"}], "contents": "<p>AppFolio revolutionizes the way small and medium-sized businesses grow and compete. We understand that a positive work environment coupled with a creative and talented team is the key to success. We love what we do, and we’re looking for motivated, creative self-starters to join our winning team. <\/p>\n\n<h4><strong>What you’ll do:<\/strong><\/h4>\n\n<ul><li>Serve as a customer-facing representative for our Tenant &amp; Owner solution<\/li><li>Communicate with customers via email and phone using our CRM system<\/li><li>Monitor, evaluate, respond and follow-up to customer inquiries and support requests<\/li><li>Resolve general inquiries and complex issues both autonomously and in a team environment<\/li><li>Collaborate on group projects and discussions<\/li><\/ul>\n\n<h4><strong>What we’re looking for:<\/strong><\/h4>\n\n<ul><li>Fluency in Spanish and English<\/li><li>Passion for customer service and relationship building as evidenced by 2+ years of customer service experience<\/li><li>A simple, friendly and authentic way of business writing and speaking that comes across honest, helpful and concise.<\/li><li>Extraordinary work ethic<\/li><li>Analytical skills and keen attention to detail<\/li><li>Ability to quickly grasp concepts and ideas and thrive in an energizing environment<\/li><li>Strong interest in technology/cloud based solutions<\/li><li>Willingness to work flexible hours as our service center operates 24/7, 365 days a year, including holidays and weekends<\/li><\/ul>\n\n<h4>What we offer:<\/h4>\n\n<ul><li>Competitive pay<\/li><li>Exceptional benefits<\/li><li>Learning environment<\/li><li>Innovative culture<br /><br />…watch our video to learn more:  <a href=\"https://youtu.be/hfPcogVWHu4\"><a target=\"url\" href=\"https://youtu.be/hfPcogVWHu4\">https://youtu.be/hfPcogVWHu4<\/a><\/a><\/li><\/ul>\n\n<p><i><br />No outside recruiter or agency submissions, please.<\/i><br /><i>Such submissions will be considered free to AppFolio.<\/i><\/p>", "publication_date": "2016-03-09T16:47:47.053274Z", "short_name": "customer-service-representative-fluent-in-spanishenglish-75b1fe", "tags": [], "refs": {"landing_page": "https://www.themuse.com/jobs/appfolio/customer-service-representative-fluent-in-spanishenglish-75b1fe"}}]}